# C-_start_new_course
*первая задача написать программу , которая выводит случайное число из отрезка и показывает наибольшую цифру числа* 

необходимо применить для этого модуль Random и его функцию Next:
```C#
int num = new Random().Next(10, 100);
```

особенность, что при этом необходимо указывать диапазон в функции слева включительно а справа на одну больше
в примере указан пример для случайного числа от _[10, 99]_

алгоритм задачи такой:
1. разделяем двухзначное силло на два отдельных числа, а затем выбираем какое больше
```C#
int num1= num/10;
int num2= num %10;
```
2. выбираем через ветвление, какое число больше то и выводим


## Task 2
__надо взять трехзначное чило и удалить вторую цифру__

применяем модуль Random с функцией Next для выбора от 100 до 999 бреме для этого слева число на одно больше

затем выделяем сотни и единицы

после этого множим число с сотнями на 10 и прибавляем единицы
```C#
int num = new Random().Next(100,1000);

Console.WriteLine(num);

int num1= num/100;
int num2= num %10;

int result = num1*10+num2;

Console.WriteLine(result);
```

